Converta o seguinte dicionário para DataFrame e obtenha:
Sumário de cada coluna
Média da coluna idade
Último nome da coluna nome

dados = {“nome”:[“Téo”, “Nah”, “Napoleão”], “idade”: [31, 32, 14]}

Importar a biblioteca Pandas

In [1]:
import pandas as pd

Convertendo o dicionario para DataFrame

In [4]:
dados = {
    'nome':['teo','nah','napoleao'],
    'idade':[31,32,14]
}

df = pd.DataFrame(dados)

df

       nome  idade
0       teo     31
1       nah     32
2  napoleao     14

Obtendo o sumario das colunas

coluna idade

In [17]:
sumario_numerico = df.describe()
sumario_numerico

           idade
count   3.000000
mean   25.666667
std    10.115994
min    14.000000
25%    22.500000
50%    31.000000
75%    31.500000
max    32.000000

coluna nome
obs: como nao e numerico, para esse caso foi exibido
- numero de elementos nao nulos
- numero de elementos distintos
- maior frequencia, caso empate, ordem alfabetica inversa
- frequncia da maior frequencia

In [18]:
sumario_nome = df['nome'].describe()
sumario_nome

count       3
unique      3
top       teo
freq        1
Name: nome, dtype: object

media da coluna idade

In [10]:
df['idade'].mean()

25.666666666666668

obtendo o ultimo nome da coluna nome

In [19]:
df['nome'].iloc[-1]

'napoleao'

In [20]:
#outra opcao
df['nome'].tail(1)

2    napoleao
Name: nome, dtype: object